CSI API ETABS v1
cCaseStaticNonlinear.SetGeometricNonlinearity Method
 Sets the geometric nonlinearity option for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGeometricNonlinearity(
	string Name,
	int NLGeomType
)
Function SetGeometricNonlinearity (
	Name As String,
	NLGeomType As Integer
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim NLGeomType As Integer
Dim returnValue As Integer
returnValue = instance.SetGeometricNonlinearity(Name,
	NLGeomType)
int SetGeometricNonlinearity(
	String^ Name,
	int NLGeomType
)
abstract SetGeometricNonlinearity :
        Name : string *
        NLGeomType : int -> int
Parameters
Name
Type: System.String
 The name of an existing static nonlinear load case.
NLGeomType
Type: System.Int32
Return Value
Type: Int32
 Returns zero if the option is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add static nonlinear load case
    ret = SapModel.LoadCases.StaticNonlinear.SetCase("LCASE1")
'set geometric nonlinearity option
    ret = SapModel.LoadCases.StaticNonlinear.SetGeometricNonlinearity("LCASE1", 2)
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace